# Pandas
- dataframe - special object to store data in tabular form(rows & columns)

# installation

In [2]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\asus\appdata\local\programs\python\python38-32\lib\site-packages (1.0.5)
Requirement already satisfied: numpy>=1.13.3 in c:\users\asus\appdata\local\programs\python\python38-32\lib\site-packages (from pandas) (1.18.5)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\asus\appdata\local\programs\python\python38-32\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\asus\appdata\local\programs\python\python38-32\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in c:\users\asus\appdata\local\programs\python\python38-32\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)

In [3]:
import numpy as np
import pandas as pd

try to create a dataframe

In [8]:
user_data={
    "MarksA":np.random.randint(1,100,5),
    "MarksB":np.random.randint(50,100,5),
    "MarksC":np.random.randint(1,100,5)
}

In [9]:
user_data

{'MarksA': array([78, 72, 60, 12, 44]),
 'MarksB': array([67, 50, 73, 53, 60]),
 'MarksC': array([40, 58, 83, 86, 60])}

In [10]:
user_data

{'MarksA': array([78, 72, 60, 12, 44]),
 'MarksB': array([67, 50, 73, 53, 60]),
 'MarksC': array([40, 58, 83, 86, 60])}

In [11]:
df = pd.DataFrame(user_data)

In [12]:
df

   MarksA  MarksB  MarksC
0      78      67      40
1      72      50      58
2      60      73      83
3      12      53      86
4      44      60      60

In [13]:
# to see specified number of rows
df.head(3)

   MarksA  MarksB  MarksC
0      78      67      40
1      72      50      58
2      60      73      83

In [15]:
# to see columns name
df.columns

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

# convert to csv

In [16]:
df.to_csv('marks.csv')

In [17]:
mydata=pd.read_csv('marks.csv')

In [18]:
mydata

   Unnamed: 0  MarksA  MarksB  MarksC
0           0      78      67      40
1           1      72      50      58
2           2      60      73      83
3           3      12      53      86
4           4      44      60      60

to drop a certain column

In [21]:
mydata.drop(columns=['Unnamed: 0'])

   MarksA  MarksB  MarksC
0      78      67      40
1      72      50      58
2      60      73      83
3      12      53      86
4      44      60      60